# Creating SQL Databases
- Zach Hanson

## Libraries

In [1]:
#Standard 
import pandas as pd
import numpy as np

#JSON
import json

#SQL
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database
from sqlalchemy_utils import database_exists
from sqlalchemy.types import *

## SQL Login and Engine

In [2]:
#Loading mysql credentials
with open('/Users/Zach/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
#Making connection
connection = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/movie_database"
engine = create_engine(connection)

In [4]:
#Check if database exists
if database_exists(connection):
    print('Database exists.')
else:
    #Create it
    create_database(connection)
    print('Database created.')

Database exists.

## Importing Current Dataframes

In [5]:
title_basics = pd.read_csv('Data/title_basics.csv.gz')
title_basics.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama

In [6]:
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
title_ratings.head(3)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1953
1  tt0000002            5.8       263
2  tt0000005            6.2      2589

In [7]:
tmdb_results = pd.read_csv('Data/complete_tmdb_data.csv.gz')
tmdb_results.head(3)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification\r
0,tt0096056,0.0,/95U3MUDXu4xSCmVLtWgargRipDi.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,109809.0,en,Crime and Punishment,...,0.0,126.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Crime and Punishment,0.0,5.5,11.0,\r
1,tt0118926,0.0,/qR3Dk3ctnrrxkAI6I472RhamIbu.jpg,NaN,0.0,"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name...",NaN,20689.0,en,The Dancer Upstairs,...,5227348.0,132.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"An honest man caught in a world of intrigue, p...",The Dancer Upstairs,0.0,6.3,51.0,R\r
2,tt0119980,0.0,NaN,NaN,0.0,"[{'id': 80, 'name': 'Crime'}, {'id': 18, 'name...",NaN,563364.0,en,Random Shooting in LA,...,0.0,91.0,[],Released,NaN,Random Shooting in LA,0.0,0.0,0.0,\r

## Normalizing Tables

### Genres

In [8]:
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]

In [9]:
#Creating new column with split genres
genres_split = title_basics['genres'].str.split(',')
genres_split

0           [Comedy, Fantasy, Romance]
1                              [Drama]
2                              [Drama]
3             [Comedy, Horror, Sci-Fi]
4                              [Drama]
                     ...
85562                          [Drama]
85563         [Comedy, Drama, Fantasy]
85564                          [Drama]
85565    [Action, Adventure, Thriller]
85566                 [Drama, History]
Name: genres, Length: 85567, dtype: object

In [10]:
#Exploding split columns
exploded_genres = title_basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
85565,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
85565,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
85565,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
85566,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
85566,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [11]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [12]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [13]:
genre_ints = range(len(unique_genres))

genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [14]:
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [15]:
title_genres['genres_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genres_id
0  tt0035423          5
0  tt0035423          9
0  tt0035423         18
1  tt0062336          7
2  tt0069049          7

In [16]:
genres = pd.DataFrame({'Genre_Name': genre_map.keys(),
                       'Genre_ID': genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Removing Redundant Information

In [17]:
title_basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]

In [18]:
#Dropping 'originalTitle', we will use 'primaryTitle' instead
title_basics = title_basics.drop(columns='originalTitle')

In [19]:
#Dropping 'isAdult' since we can see if its an adult film in the 'genres' column
title_basics = title_basics.drop(columns='isAdult')

In [20]:
#Dropping 'titleType' since all types will be movies
title_basics = title_basics.drop(columns='titleType')

In [21]:
#Dropping 'genres' row since we will be using the keys for genres
title_basics = title_basics.drop(columns=['genres', 'genres_split'])

In [22]:
title_basics.head(2)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70

### TMDB Results

In [23]:
tmdb_results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54357 entries, 0 to 54356
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                54357 non-null  object
 1   adult                  54357 non-null  float64
 2   backdrop_path          33807 non-null  object
 3   belongs_to_collection  3714 non-null   object
 4   budget                 54357 non-null  float64
 5   genres                 54357 non-null  object
 6   homepage               12745 non-null  object
 7   id                     54357 non-null  float64
 8   original_language      54357 non-null  object
 9   original_title         54357 non-null  object
 10  overview               53132 non-null  object
 11  popularity             54357 non-null  float64
 12  poster_path            49575 non-null  object
 13  production_companies   54357 non-null  object
 14  production_countries   54357 non-null  object
 15  release_date           53586 non-null  object
 16  revenue                54357 non-null  float64
 17  runtime                54357 non-null  float64
 18  spoken_languages       54357 non-null  object
 19  status                 54357 non-null  object
 20  tagline                20725 non-null  object
 21  title                  54357 non-null  object
 22  video                  54357 non-null  float64
 23  vote_average           54357 non-null  float64
 24  vote_count             54357 non-null  float64
         54357 non-null  object
dtypes: float64(9), object(17)
memory usage: 10.8+ MB

In [25]:
#Project description states that these 4 columns are what we want to extract from this data frame
#All of the other relevant information is contained in our other tables.
tmdb_data = tmdb_results[['imdb_id', 'revenue', 'budget', 'certification\r']]
tmdb_data.head()

     imdb_id      revenue      budget certification\r
0  tt0096056          0.0         0.0              \r
1  tt0118926    5227348.0         0.0             R\r
2  tt0119980          0.0         0.0              \r
3  tt0120679   56298474.0  12000000.0             R\r
4  tt0120804  102984862.0  33000000.0             R\r

In [27]:
tmdb_data['certification\r'].value_counts()

\r                                   40783
R\r                                   5668
NR\r                                  3017
PG-13\r                               3014
PG\r                                  1313
G\r                                    403
NC-17\r                                148
Unrated\r                                5
UR\r                                     1
Not Rated\r                              1
ScreamFest Horror Film Festival\r        1
PG-13 \r                                 1
10\r                                     1
-\r                                      1
Name: certification\r, dtype: int64

In [ ]:
#Removing first row since it does not contain any information
tmdb_data = tmdb_data.loc[tmdb_data['imdb_id']!='0']
tmdb_data.head()

## Converting to SQL

### title_basics

In [ ]:
title_basics.dtypes

In [ ]:
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

basics_schema = {
    'tconst': String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'startYear': Float(),
    'endYear': Float(),
    'runtimeMinutes': Integer()
}

In [ ]:
title_basics.to_sql('title_basics', engine, dtype=basics_schema, if_exists='replace', index=False)

In [ ]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [ ]:
q='''
SELECT *
FROM title_basics
LIMIT 5'''
pd.read_sql(q, engine)

### title_ratings

In [ ]:
title_ratings.dtypes

In [ ]:
key_len = title_ratings['tconst'].fillna('').map(len).max()

ratings_schema = {
    'tconst': String(key_len+1),
    'averageRating': Float(),
    'numVotes': Integer()
}

In [ ]:
title_ratings.to_sql('title_ratings', engine, dtype=ratings_schema, if_exists='replace', index=False)

In [ ]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [ ]:
q='''
SELECT *
FROM title_ratings
LIMIT 5'''
pd.read_sql(q, engine)

### title_genres

In [ ]:
title_genres.dtypes

In [ ]:
tconst_len = title_genres['tconst'].fillna('').map(len).max()

title_genres_schema = {
    'tconst': Text(tconst_len+1),
    'genres_id': Integer()
}

In [ ]:
title_genres.to_sql('title_genres', engine, dtype=title_genres_schema, if_exists='replace', index=False)

In [ ]:
q='''
SELECT *
FROM title_genres
LIMIT 5'''
pd.read_sql(q, engine)

### genres

In [ ]:
genres.dtypes

In [ ]:
name_len = genres['Genre_Name'].fillna('').map(len).max()

genres_schema = {
    'Genre_Name': Text(name_len+1),
    'Genre_ID': Integer()
}

In [ ]:
genres.set_index('Genre_ID').to_sql('genres', engine, dtype=genres_schema, if_exists='replace', index=False)

In [ ]:
q='''
SELECT *
FROM genres
LIMIT 5'''
pd.read_sql(q, engine)

### tmdb_data

In [ ]:
tmdb_data.head()

In [44]:
tmdb_data.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

In [45]:
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

tmdb_schema = {
    'imdb_id': String(key_len+1),
    'revenue': Float(),
    'budget': Float(),
    'certification': Text(cert_len+1)
}

In [46]:
tmdb_data.to_sql('tmdb_data', engine, dtype=tmdb_schema, if_exists='replace', index=False)

2525

In [47]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [48]:
q='''
SELECT *
FROM tmdb_data
LIMIT 5'''
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

## All Tables

In [49]:
q='''
SHOW TABLES;
'''
pd.read_sql(q, engine)

  Tables_in_movie_database
0                   genres
1             title_basics
2             title_genres
3            title_ratings
4                tmdb_data